# Pandas portfolio part3

In this part of the pandas prgoress, the topic is going to be how to restructure the data in some useful way. There are some powerfull functions that allow us to do that.
#### describe() function:
this is a handy function to get a general information about the DataFrame info. checkout examples below:

In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

df = pd.DataFrame(data)
df.describe()          # this will just prosses the numerical column

             Age
count   4.000000
mean   26.250000
std     4.349329
min    22.000000
25%    23.500000
50%    25.500000
75%    28.250000
max    32.000000

In [9]:
df.Name.describe()

count         4
unique        4
top       Alice
freq          1
Name: Name, dtype: object

In [10]:
df.City.describe()

count            4
unique           4
top       New York
freq             1
Name: City, dtype: object

#### smaller functions:
if it was desired to only prosses a particular info of a DataFrame, there are ways to do that. check these below:

In [12]:
df.Name.unique()

array(['Alice', 'Bob', 'Charlie', 'David'], dtype=object)

In [13]:
df.Name.count()

4

In [14]:
df.Age.mean()

26.25

---

#### a quick review of Lambda function in python
Python Lambda Functions are **anonymous** functions, means that the function is without a name.
as the normal functions used to describe by the keyword *def*, these types of functions are described by the keyword *lambda*.

here is how the syntax is implemented
there will be a keyword *lambda*, the parameters comes right after that keyword. there will be a ':', which allows you to write down the expression.
```python
some_name = lambda parameter_1, parameter_2: expression
```
checkout this example:

In [4]:
Max = lambda a, b: a if(a > b) else b
Max(1, 10)

10

In [4]:
y = 10
y_cube = lambda y: y*y*y
y_cube(10)

1000

---

#### what do you know about *map*? 
The map() function is used to apply a function to every item of an iterable (like a list or tuple) and return a map object, which is an iterator. An iterable in Python includes lists, tuples, sets, strings, and moreâ€”anything you can iterate over element by element.
here is what the syntax looks like:
```python
map(function, iterables)
```
checkout these examples below:

In [8]:
def myfunc(n):
  return len(n)

x = map(myfunc, ('apple', 'banana', 'cherry'))
x

as you saw above, it returns a map object, the real array output is not avalible like above, so you should try this to see the original output array:

In [10]:
list(x)

[5, 6, 6]

---

#### Don't go too soon! that was the python bulit-in map function!
As you saw above, we hed to use the syntax like **list()** to see the list:
```python
list(x)
```
that is due to the fact that was a python bulit-in function, and it Returns an iterator (that you can convert to a list). But what if  we needed a  return type of a new pandas Series (a column in a DataFrame) directly? the answer would be a pandas map function.

So how does the map function for pandas looks like? here is how the simple syntax looks like:
```python
Series.map(function)
```
checkout the examples below to understand the usage of that pandas map function:

In [6]:
data = {
    'Product': ['Apple', 'Apple', 'Banana', 'Banana', 'Banana', 'Cherry'],
    'Sales': [200, 150, 100, 120, 130, 180],
    'Discount': [10, 15, 5, 10, 5, 20]
}

df = pd.DataFrame(data)
df

  Product  Sales  Discount
0   Apple    200        10
1   Apple    150        15
2  Banana    100         5
3  Banana    120        10
4  Banana    130         5
5  Cherry    180        20

Now according to that DataFrame, consider that a new columnn is required, with a desired lambda function like below

In [9]:
df['discount %'] = df['Discount'].map(lambda row: row/100)
df

  Product  Sales  Discount  discount %
0   Apple    200        10        0.10
1   Apple    150        15        0.15
2  Banana    100         5        0.05
3  Banana    120        10        0.10
4  Banana    130         5        0.05
5  Cherry    180        20        0.20

here is how that got solved, using pandas map function!

---

#### how are *map* functions and *lambda* functions related?
consider you got an array and have a lambda function, the lambda function's parameter is just one single variable and not an array, but you want to map that array to that lambda function; in this situation, *map* function is the solution.

In [11]:
numbers = [1, 2, 3, 4, 5]
result = map(lambda x: x + 1, numbers)
list(result)

[2, 3, 4, 5, 6]

---

#### so, how does *map* and *lambda* functions related to pandas?
there will be some times that those functions would work like a magic! checkout the example:

In [17]:
data = {
    'Fruit': ['Apple', 'Banana', 'Cherry', 'Date', 'Elderberry'],
    'Quantity': [10, 20, 15, 7, 12],
    'Price_per_Unit': [0.5, 0.2, 0.75, 1.0, 2.5]
}

df = pd.DataFrame(data)
df

        Fruit  Quantity  Price_per_Unit
0       Apple        10            0.50
1      Banana        20            0.20
2      Cherry        15            0.75
3        Date         7            1.00
4  Elderberry        12            2.50

#### what is apply() function and how is that relate to pandas map() function? :/
ok, now there is a new term to understand: the keyword *apply*: 
The apply() method allows you to apply a function along one of the axis of the DataFrame, default 0, which is the index (row) axis.
here is how the syntax looks like:
```python
dataframe.apply(func, axis, raw, result_type, args, kwds)
```
checkout this example:
```python
def calc_sum(x):
return x.sum()

data = {
  "x": [50, 40, 30],
  "y": [300, 1112, 42]
}

df = pd.DataFrame(data)

x = df.apply(calc_sum)
```
now, back to our previous example:

In [18]:
df['Total_Price'] = df.apply(lambda row: row['Quantity'] * row['Price_per_Unit'], axis=1)
df

        Fruit  Quantity  Price_per_Unit  Total_Price
0       Apple        10            0.50         5.00
1      Banana        20            0.20         4.00
2      Cherry        15            0.75        11.25
3        Date         7            1.00         7.00
4  Elderberry        12            2.50        30.00

In [20]:
fruit_colors = {
    'Apple': 'Red',
    'Banana': 'Yellow',
    'Cherry': 'Red',
    'Date': 'Brown',
    'Elderberry': 'Purple'
}
df['Color'] = df['Fruit'].map(fruit_colors)
df

        Fruit  Quantity  Price_per_Unit  Total_Price   Color
0       Apple        10            0.50         5.00     Red
1      Banana        20            0.20         4.00  Yellow
2      Cherry        15            0.75        11.25     Red
3        Date         7            1.00         7.00   Brown
4  Elderberry        12            2.50        30.00  Purple

In [21]:
'''
np12 -> 22 now
np-32 -> 32 now
29 new 
pw310 yamaha -> 27 -> birjand 
tehran, esfahan
'''

'\nnp12 -> 22 now\nnp-32 -> 32 now\n29 new \npw310 yamaha -> 27 -> birjand \ntehran, esfahan\n'

In [23]:
df.value_counts()

Fruit       Quantity  Price_per_Unit  Total_Price  Color
Apple       10        0.50            5.00         Red       1
Banana      20        0.20            4.00         Yellow    1
Cherry      15        0.75            11.25        Red       1
Date        7         1.00            7.00         Brown     1
Elderberry  12        2.50            30.00        Purple    1
Name: count, dtype: int64

In [24]:
data = {
  "sales": [23, 34, 56],
  "age": [50, 40, 30]
}

df = pd.DataFrame(data)

print(df.idxmax())

sales    2
age      0
dtype: int64